In [1]:
from pandasql import sqldf, load_meat, load_births

In [2]:
meat = load_meat()
births = load_births()
pysqldf = lambda q: sqldf(q, globals())

In [3]:
print(type(meat)) # shows the type of the dataframe called meat
print(type(births)) # 
print(pysqldf) # shows the type of the variable pasqldf

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.frame.DataFrame'>
<function <lambda> at 0x7fe5c1758b80>

In [4]:
meat.head(100)

,date,beef,veal,pork,lamb_and_mutton,broilers,other_chicken,turkey
0,1944-01-01,751.0,85.0,1280.0,89.0,NaN,NaN,NaN
1,1944-02-01,713.0,77.0,1169.0,72.0,NaN,NaN,NaN
2,1944-03-01,741.0,90.0,1128.0,75.0,NaN,NaN,NaN
3,1944-04-01,650.0,89.0,978.0,66.0,NaN,NaN,NaN
4,1944-05-01,681.0,106.0,1029.0,78.0,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...
95,1951-12-01,699.0,68.0,1077.0,41.0,NaN,NaN,NaN
96,1952-01-01,810.0,75.0,1130.0,54.0,NaN,NaN,NaN
97,1952-02-01,721.0,66.0,945.0,52.0,NaN,NaN,NaN
98,1952-03-01,685.0,70.0,924.0,51.0,NaN,NaN,NaN
99,1952-04-01,703.0,71.0,839.0,50.0,NaN,NaN,NaN

In [5]:
births.head()

        date  births
0 1975-01-01  265775
1 1975-02-01  241045
2 1975-03-01  268849
3 1975-04-01  247455
4 1975-05-01  254545

In [6]:
print(pysqldf("SELECT * FROM meat;")) # for $item in //meat; return $item

                           date    beef   veal    pork  lamb_and_mutton  \
0    1944-01-01 00:00:00.000000   751.0   85.0  1280.0             89.0
1    1944-02-01 00:00:00.000000   713.0   77.0  1169.0             72.0
2    1944-03-01 00:00:00.000000   741.0   90.0  1128.0             75.0
3    1944-04-01 00:00:00.000000   650.0   89.0   978.0             66.0
4    1944-05-01 00:00:00.000000   681.0  106.0  1029.0             78.0
..                          ...     ...    ...     ...              ...
822  2012-07-01 00:00:00.000000  2200.8    9.5  1721.8             12.5
823  2012-08-01 00:00:00.000000  2367.5   10.1  1997.9             14.2
824  2012-09-01 00:00:00.000000  2016.0    8.8  1911.0             12.5
825  2012-10-01 00:00:00.000000  2343.7   10.3  2210.4             14.2
826  2012-11-01 00:00:00.000000  2206.6   10.1  2078.7             12.4

     broilers  other_chicken  turkey
0         NaN            NaN     NaN
1         NaN            NaN     NaN
2         NaN            NaN     NaN
3         NaN            NaN     NaN
4         NaN            NaN     NaN
..        ...            ...     ...
822    3127.0           43.4   497.2
823    3317.4           51.0   530.1
824    2927.1           43.7   453.1
825    3335.0           43.8   579.9
826    3006.7           37.5   515.3

[827 rows x 8 columns]

In [7]:
print(pysqldf("SELECT beef FROM meat;"))

       beef
0     751.0
1     713.0
2     741.0
3     650.0
4     681.0
..      ...
822  2200.8
823  2367.5
824  2016.0
825  2343.7
826  2206.6

[827 rows x 1 columns]

In [8]:
print(pysqldf("SELECT * from meat;"))

                           date    beef   veal    pork  lamb_and_mutton  \
0    1944-01-01 00:00:00.000000   751.0   85.0  1280.0             89.0
1    1944-02-01 00:00:00.000000   713.0   77.0  1169.0             72.0
2    1944-03-01 00:00:00.000000   741.0   90.0  1128.0             75.0
3    1944-04-01 00:00:00.000000   650.0   89.0   978.0             66.0
4    1944-05-01 00:00:00.000000   681.0  106.0  1029.0             78.0
..                          ...     ...    ...     ...              ...
822  2012-07-01 00:00:00.000000  2200.8    9.5  1721.8             12.5
823  2012-08-01 00:00:00.000000  2367.5   10.1  1997.9             14.2
824  2012-09-01 00:00:00.000000  2016.0    8.8  1911.0             12.5
825  2012-10-01 00:00:00.000000  2343.7   10.3  2210.4             14.2
826  2012-11-01 00:00:00.000000  2206.6   10.1  2078.7             12.4

     broilers  other_chicken  turkey
0         NaN            NaN     NaN
1         NaN            NaN     NaN
2         NaN            NaN     NaN
3         NaN            NaN     NaN
4         NaN            NaN     NaN
..        ...            ...     ...
822    3127.0           43.4   497.2
823    3317.4           51.0   530.1
824    2927.1           43.7   453.1
825    3335.0           43.8   579.9
826    3006.7           37.5   515.3

[827 rows x 8 columns]

## SELECT

* Use SELECT to specify Columns.
    e.g. SELECT beef
* USE SELECT * to select all columns
    e.g. SELECT *
    
Note: "SELECT *" is an incomplete query. You must also specify the table using FROM.

## FROM

We use the FROM statement to specify a table. 

Here we have two tables called "meat" and "births." You can try SELECT * on any of them.

In [9]:
# example

print(pysqldf("SELECT date FROM meat;"))

                           date
0    1944-01-01 00:00:00.000000
1    1944-02-01 00:00:00.000000
2    1944-03-01 00:00:00.000000
3    1944-04-01 00:00:00.000000
4    1944-05-01 00:00:00.000000
..                          ...
822  2012-07-01 00:00:00.000000
823  2012-08-01 00:00:00.000000
824  2012-09-01 00:00:00.000000
825  2012-10-01 00:00:00.000000
826  2012-11-01 00:00:00.000000

[827 rows x 1 columns]

In [10]:
print(pysqldf("SELECT beef FROM meat;"))

       beef
0     751.0
1     713.0
2     741.0
3     650.0
4     681.0
..      ...
822  2200.8
823  2367.5
824  2016.0
825  2343.7
826  2206.6

[827 rows x 1 columns]

In [11]:
print(pysqldf("SELECT veal FROM meat;"))

      veal
0     85.0
1     77.0
2     90.0
3     89.0
4    106.0
..     ...
822    9.5
823   10.1
824    8.8
825   10.3
826   10.1

[827 rows x 1 columns]

In [12]:
print(pysqldf("SELECT * FROM meat;"))

                           date    beef   veal    pork  lamb_and_mutton  \
0    1944-01-01 00:00:00.000000   751.0   85.0  1280.0             89.0
1    1944-02-01 00:00:00.000000   713.0   77.0  1169.0             72.0
2    1944-03-01 00:00:00.000000   741.0   90.0  1128.0             75.0
3    1944-04-01 00:00:00.000000   650.0   89.0   978.0             66.0
4    1944-05-01 00:00:00.000000   681.0  106.0  1029.0             78.0
..                          ...     ...    ...     ...              ...
822  2012-07-01 00:00:00.000000  2200.8    9.5  1721.8             12.5
823  2012-08-01 00:00:00.000000  2367.5   10.1  1997.9             14.2
824  2012-09-01 00:00:00.000000  2016.0    8.8  1911.0             12.5
825  2012-10-01 00:00:00.000000  2343.7   10.3  2210.4             14.2
826  2012-11-01 00:00:00.000000  2206.6   10.1  2078.7             12.4

     broilers  other_chicken  turkey
0         NaN            NaN     NaN
1         NaN            NaN     NaN
2         NaN            NaN     NaN
3         NaN            NaN     NaN
4         NaN            NaN     NaN
..        ...            ...     ...
822    3127.0           43.4   497.2
823    3317.4           51.0   530.1
824    2927.1           43.7   453.1
825    3335.0           43.8   579.9
826    3006.7           37.5   515.3

[827 rows x 8 columns]

## LIMIT

Use limit to get the top n number of items from the query. You can use limit when you want a different number of items from the default.

In [13]:
print(pysqldf("SELECT * FROM meat LIMIT 4;"))

                         date   beef  veal    pork  lamb_and_mutton broilers  \
0  1944-01-01 00:00:00.000000  751.0  85.0  1280.0             89.0     None
1  1944-02-01 00:00:00.000000  713.0  77.0  1169.0             72.0     None
2  1944-03-01 00:00:00.000000  741.0  90.0  1128.0             75.0     None
3  1944-04-01 00:00:00.000000  650.0  89.0   978.0             66.0     None

  other_chicken turkey
0          None   None
1          None   None
2          None   None
3          None   None

In [14]:
print(pysqldf("SELECT * FROM meat LIMIT 70;"))

                          date   beef   veal    pork  lamb_and_mutton  \
0   1944-01-01 00:00:00.000000  751.0   85.0  1280.0             89.0
1   1944-02-01 00:00:00.000000  713.0   77.0  1169.0             72.0
2   1944-03-01 00:00:00.000000  741.0   90.0  1128.0             75.0
3   1944-04-01 00:00:00.000000  650.0   89.0   978.0             66.0
4   1944-05-01 00:00:00.000000  681.0  106.0  1029.0             78.0
..                         ...    ...    ...     ...              ...
65  1949-06-01 00:00:00.000000  765.0  103.0   657.0             42.0
66  1949-07-01 00:00:00.000000  743.0  103.0   584.0             45.0
67  1949-08-01 00:00:00.000000  835.0  123.0   605.0             54.0
68  1949-09-01 00:00:00.000000  821.0  121.0   637.0             55.0
69  1949-10-01 00:00:00.000000  772.0  120.0   764.0             56.0

   broilers other_chicken turkey
0      None          None   None
1      None          None   None
2      None          None   None
3      None          None   None
4      None          None   None
..      ...           ...    ...
65     None          None   None
66     None          None   None
67     None          None   None
68     None          None   None
69     None          None   None

[70 rows x 8 columns]

In [15]:
print(pysqldf("SELECT beef FROM meat WHERE beef<700;")) # Query 1

     beef
0   650.0
1   681.0
2   658.0
3   662.0
4   605.0
5   461.0
6   366.0
7   662.0
8   650.0
9   681.0
10  697.0
11  676.0
12  694.0
13  650.0
14  696.0
15  658.0
16  591.0
17  676.0
18  697.0
19  699.0
20  685.0
21  698.0

In [16]:
print(pysqldf("SELECT * FROM meat WHERE beef<700;")) # query 2

                          date   beef   veal    pork  lamb_and_mutton  \
0   1944-04-01 00:00:00.000000  650.0   89.0   978.0             66.0
1   1944-05-01 00:00:00.000000  681.0  106.0  1029.0             78.0
2   1944-06-01 00:00:00.000000  658.0  125.0   962.0             79.0
3   1944-07-01 00:00:00.000000  662.0  142.0   796.0             82.0
4   1946-05-01 00:00:00.000000  605.0   83.0   810.0             65.0
5   1946-06-01 00:00:00.000000  461.0   78.0   505.0             75.0
6   1946-09-01 00:00:00.000000  366.0   98.0   124.0             63.0
7   1948-02-01 00:00:00.000000  662.0   87.0   679.0             60.0
8   1948-05-01 00:00:00.000000  650.0   97.0   653.0             47.0
9   1948-07-01 00:00:00.000000  681.0  116.0   576.0             55.0
10  1949-02-01 00:00:00.000000  697.0   82.0   701.0             51.0
11  1950-02-01 00:00:00.000000  676.0   80.0   699.0             46.0
12  1950-04-01 00:00:00.000000  694.0   87.0   702.0             44.0
13  1951-02-01 00:00:00.000000  650.0   66.0   720.0             38.0
14  1951-03-01 00:00:00.000000  696.0   73.0   837.0             39.0
15  1951-04-01 00:00:00.000000  658.0   67.0   813.0             36.0
16  1951-06-01 00:00:00.000000  591.0   78.0   798.0             39.0
17  1951-07-01 00:00:00.000000  676.0   86.0   686.0             42.0
18  1951-09-01 00:00:00.000000  697.0   87.0   715.0             41.0
19  1951-12-01 00:00:00.000000  699.0   68.0  1077.0             41.0
20  1952-03-01 00:00:00.000000  685.0   70.0   924.0             51.0
21  1952-06-01 00:00:00.000000  698.0   83.0   727.0             46.0

   broilers other_chicken turkey
0      None          None   None
1      None          None   None
2      None          None   None
3      None          None   None
4      None          None   None
5      None          None   None
6      None          None   None
7      None          None   None
8      None          None   None
9      None          None   None
10     None          None   None
11     None          None   None
12     None          None   None
13     None          None   None
14     None          None   None
15     None          None   None
16     None          None   None
17     None          None   None
18     None          None   None
19     None          None   None
20     None          None   None
21     None          None   None

In [18]:
print(pysqldf("SELECT beef, pork FROM meat WHERE beef<700;")) # query 3

     beef    pork
0   650.0   978.0
1   681.0  1029.0
2   658.0   962.0
3   662.0   796.0
4   605.0   810.0
5   461.0   505.0
6   366.0   124.0
7   662.0   679.0
8   650.0   653.0
9   681.0   576.0
10  697.0   701.0
11  676.0   699.0
12  694.0   702.0
13  650.0   720.0
14  696.0   837.0
15  658.0   813.0
16  591.0   798.0
17  676.0   686.0
18  697.0   715.0
19  699.0  1077.0
20  685.0   924.0
21  698.0   727.0

In [19]:
print(pysqldf("SELECT * FROM meat WHERE beef<700 LIMIT 10;")) #

                         date   beef   veal    pork  lamb_and_mutton broilers  \
0  1944-04-01 00:00:00.000000  650.0   89.0   978.0             66.0     None
1  1944-05-01 00:00:00.000000  681.0  106.0  1029.0             78.0     None
2  1944-06-01 00:00:00.000000  658.0  125.0   962.0             79.0     None
3  1944-07-01 00:00:00.000000  662.0  142.0   796.0             82.0     None
4  1946-05-01 00:00:00.000000  605.0   83.0   810.0             65.0     None
5  1946-06-01 00:00:00.000000  461.0   78.0   505.0             75.0     None
6  1946-09-01 00:00:00.000000  366.0   98.0   124.0             63.0     None
7  1948-02-01 00:00:00.000000  662.0   87.0   679.0             60.0     None
8  1948-05-01 00:00:00.000000  650.0   97.0   653.0             47.0     None
9  1948-07-01 00:00:00.000000  681.0  116.0   576.0             55.0     None

  other_chicken turkey
0          None   None
1          None   None
2          None   None
3          None   None
4          None   None
5          None   None
6          None   None
7          None   None
8          None   None
9          None   None

In [20]:
print(pysqldf("SELECT * FROM meat WHERE veal < 100;"))

                           date    beef  veal    pork  lamb_and_mutton  \
0    1944-01-01 00:00:00.000000   751.0  85.0  1280.0             89.0
1    1944-02-01 00:00:00.000000   713.0  77.0  1169.0             72.0
2    1944-03-01 00:00:00.000000   741.0  90.0  1128.0             75.0
3    1944-04-01 00:00:00.000000   650.0  89.0   978.0             66.0
4    1945-02-01 00:00:00.000000   816.0  97.0   724.0             81.0
..                          ...     ...   ...     ...              ...
705  2012-07-01 00:00:00.000000  2200.8   9.5  1721.8             12.5
706  2012-08-01 00:00:00.000000  2367.5  10.1  1997.9             14.2
707  2012-09-01 00:00:00.000000  2016.0   8.8  1911.0             12.5
708  2012-10-01 00:00:00.000000  2343.7  10.3  2210.4             14.2
709  2012-11-01 00:00:00.000000  2206.6  10.1  2078.7             12.4

     broilers  other_chicken  turkey
0         NaN            NaN     NaN
1         NaN            NaN     NaN
2         NaN            NaN     NaN
3         NaN            NaN     NaN
4         NaN            NaN     NaN
..        ...            ...     ...
705    3127.0           43.4   497.2
706    3317.4           51.0   530.1
707    2927.1           43.7   453.1
708    3335.0           43.8   579.9
709    3006.7           37.5   515.3

[710 rows x 8 columns]

In [21]:
## SELECT multiple columns

print(pysqldf("SELECT date, beef FROM meat WHERE veal < 100;"))

                           date    beef
0    1944-01-01 00:00:00.000000   751.0
1    1944-02-01 00:00:00.000000   713.0
2    1944-03-01 00:00:00.000000   741.0
3    1944-04-01 00:00:00.000000   650.0
4    1945-02-01 00:00:00.000000   816.0
..                          ...     ...
705  2012-07-01 00:00:00.000000  2200.8
706  2012-08-01 00:00:00.000000  2367.5
707  2012-09-01 00:00:00.000000  2016.0
708  2012-10-01 00:00:00.000000  2343.7
709  2012-11-01 00:00:00.000000  2206.6

[710 rows x 2 columns]

In [22]:
# Create new column
print(pysqldf("SELECT date, beef, veal, \
                ((beef + veal) / 2) AS beef_veal_avg \
                FROM meat \
                WHERE veal < 100;"))

                           date    beef  veal  beef_veal_avg
0    1944-01-01 00:00:00.000000   751.0  85.0         418.00
1    1944-02-01 00:00:00.000000   713.0  77.0         395.00
2    1944-03-01 00:00:00.000000   741.0  90.0         415.50
3    1944-04-01 00:00:00.000000   650.0  89.0         369.50
4    1945-02-01 00:00:00.000000   816.0  97.0         456.50
..                          ...     ...   ...            ...
705  2012-07-01 00:00:00.000000  2200.8   9.5        1105.15
706  2012-08-01 00:00:00.000000  2367.5  10.1        1188.80
707  2012-09-01 00:00:00.000000  2016.0   8.8        1012.40
708  2012-10-01 00:00:00.000000  2343.7  10.3        1177.00
709  2012-11-01 00:00:00.000000  2206.6  10.1        1108.35

[710 rows x 4 columns]

# Logical operations


* LIKE
* IN
* BETWEEN
* IS NULL
* AND
* OR
* NOT

In [26]:
# LIKE; Find similar values, not necessarilyb exact

print(pysqldf("SELECT date, beef FROM meat WHERE date LIKE '19%';"))

                           date    beef
0    1944-01-01 00:00:00.000000   751.0
1    1944-02-01 00:00:00.000000   713.0
2    1944-03-01 00:00:00.000000   741.0
3    1944-04-01 00:00:00.000000   650.0
4    1944-05-01 00:00:00.000000   681.0
..                          ...     ...
667  1999-08-01 00:00:00.000000  2307.0
668  1999-09-01 00:00:00.000000  2275.0
669  1999-10-01 00:00:00.000000  2265.0
670  1999-11-01 00:00:00.000000  2144.0
671  1999-12-01 00:00:00.000000  2113.0

[672 rows x 2 columns]

In [27]:
# IN; queries matches values specified in IN.

print(pysqldf("SELECT date, beef FROM meat WHERE beef IN (842, 591);"))

                         date   beef
0  1951-01-01 00:00:00.000000  842.0
1  1951-06-01 00:00:00.000000  591.0

In [28]:
# BETWEEN; Query returns items that fall between a range.

print(pysqldf("SELECT date, beef FROM meat WHERE beef BETWEEN 591 AND 842;"))

                          date   beef
0   1944-01-01 00:00:00.000000  751.0
1   1944-02-01 00:00:00.000000  713.0
2   1944-03-01 00:00:00.000000  741.0
3   1944-04-01 00:00:00.000000  650.0
4   1944-05-01 00:00:00.000000  681.0
..                         ...    ...
84  1952-06-01 00:00:00.000000  698.0
85  1952-07-01 00:00:00.000000  786.0
86  1952-08-01 00:00:00.000000  793.0
87  1952-09-01 00:00:00.000000  841.0
88  1952-11-01 00:00:00.000000  768.0

[89 rows x 2 columns]

In [29]:
"""
IS NULL; will return entries that have NULL values specified by WHERE.
IS NOT NULL;
"""
print(pysqldf("SELECT * FROM meat WHERE broilers IS NULL"))

                           date    beef   veal    pork  lamb_and_mutton  \
0    1944-01-01 00:00:00.000000   751.0   85.0  1280.0             89.0
1    1944-02-01 00:00:00.000000   713.0   77.0  1169.0             72.0
2    1944-03-01 00:00:00.000000   741.0   90.0  1128.0             75.0
3    1944-04-01 00:00:00.000000   650.0   89.0   978.0             66.0
4    1944-05-01 00:00:00.000000   681.0  106.0  1029.0             78.0
..                          ...     ...    ...     ...              ...
187  1959-08-01 00:00:00.000000  1083.0   76.0   792.0             52.0
188  1959-09-01 00:00:00.000000  1177.0   87.0   926.0             63.0
189  1959-10-01 00:00:00.000000  1186.0   92.0  1060.0             64.0
190  1959-11-01 00:00:00.000000  1080.0   80.0  1028.0             57.0
191  1959-12-01 00:00:00.000000  1160.0   80.0  1125.0             64.0

    broilers other_chicken turkey
0       None          None   None
1       None          None   None
2       None          None   None
3       None          None   None
4       None          None   None
..       ...           ...    ...
187     None          None   None
188     None          None   None
189     None          None   None
190     None          None   None
191     None          None   None

[192 rows x 8 columns]

In [30]:
print(pysqldf("SELECT * FROM meat WHERE lamb_and_mutton IS NOT NULL"))

                           date    beef   veal    pork  lamb_and_mutton  \
0    1944-01-01 00:00:00.000000   751.0   85.0  1280.0             89.0
1    1944-02-01 00:00:00.000000   713.0   77.0  1169.0             72.0
2    1944-03-01 00:00:00.000000   741.0   90.0  1128.0             75.0
3    1944-04-01 00:00:00.000000   650.0   89.0   978.0             66.0
4    1944-05-01 00:00:00.000000   681.0  106.0  1029.0             78.0
..                          ...     ...    ...     ...              ...
822  2012-07-01 00:00:00.000000  2200.8    9.5  1721.8             12.5
823  2012-08-01 00:00:00.000000  2367.5   10.1  1997.9             14.2
824  2012-09-01 00:00:00.000000  2016.0    8.8  1911.0             12.5
825  2012-10-01 00:00:00.000000  2343.7   10.3  2210.4             14.2
826  2012-11-01 00:00:00.000000  2206.6   10.1  2078.7             12.4

     broilers  other_chicken  turkey
0         NaN            NaN     NaN
1         NaN            NaN     NaN
2         NaN            NaN     NaN
3         NaN            NaN     NaN
4         NaN            NaN     NaN
..        ...            ...     ...
822    3127.0           43.4   497.2
823    3317.4           51.0   530.1
824    2927.1           43.7   453.1
825    3335.0           43.8   579.9
826    3006.7           37.5   515.3

[827 rows x 8 columns]

In [32]:
# AND; allows you to select rows that statisfy two conditions.

print(pysqldf("SELECT * \
                  FROM meat \
                  WHERE lamb_and_mutton IS NULL AND pork > 100"))

Empty DataFrame
Columns: [date, beef, veal, pork, lamb_and_mutton, broilers, other_chicken, turkey]
Index: []

In [33]:
# OR; Allows you to choose rows that satisfy one of the two conditions specified by WHERE.

print(pysqldf("SELECT * \
                  FROM meat \
                  WHERE lamb_and_mutton IS NULL OR pork > 100"))

                           date    beef   veal    pork  lamb_and_mutton  \
0    1944-01-01 00:00:00.000000   751.0   85.0  1280.0             89.0
1    1944-02-01 00:00:00.000000   713.0   77.0  1169.0             72.0
2    1944-03-01 00:00:00.000000   741.0   90.0  1128.0             75.0
3    1944-04-01 00:00:00.000000   650.0   89.0   978.0             66.0
4    1944-05-01 00:00:00.000000   681.0  106.0  1029.0             78.0
..                          ...     ...    ...     ...              ...
822  2012-07-01 00:00:00.000000  2200.8    9.5  1721.8             12.5
823  2012-08-01 00:00:00.000000  2367.5   10.1  1997.9             14.2
824  2012-09-01 00:00:00.000000  2016.0    8.8  1911.0             12.5
825  2012-10-01 00:00:00.000000  2343.7   10.3  2210.4             14.2
826  2012-11-01 00:00:00.000000  2206.6   10.1  2078.7             12.4

     broilers  other_chicken  turkey
0         NaN            NaN     NaN
1         NaN            NaN     NaN
2         NaN            NaN     NaN
3         NaN            NaN     NaN
4         NaN            NaN     NaN
..        ...            ...     ...
822    3127.0           43.4   497.2
823    3317.4           51.0   530.1
824    2927.1           43.7   453.1
825    3335.0           43.8   579.9
826    3006.7           37.5   515.3

[827 rows x 8 columns]

In [34]:
# Don't forget LIMIT. LIMIT still works.


print(pysqldf("SELECT * \
                  FROM meat \
                  WHERE lamb_and_mutton IS NULL OR pork > 100 \
                  LIMIT 10;"))

                         date   beef   veal    pork  lamb_and_mutton broilers  \
0  1944-01-01 00:00:00.000000  751.0   85.0  1280.0             89.0     None
1  1944-02-01 00:00:00.000000  713.0   77.0  1169.0             72.0     None
2  1944-03-01 00:00:00.000000  741.0   90.0  1128.0             75.0     None
3  1944-04-01 00:00:00.000000  650.0   89.0   978.0             66.0     None
4  1944-05-01 00:00:00.000000  681.0  106.0  1029.0             78.0     None
5  1944-06-01 00:00:00.000000  658.0  125.0   962.0             79.0     None
6  1944-07-01 00:00:00.000000  662.0  142.0   796.0             82.0     None
7  1944-08-01 00:00:00.000000  787.0  175.0   748.0             87.0     None
8  1944-09-01 00:00:00.000000  774.0  182.0   678.0             91.0     None
9  1944-10-01 00:00:00.000000  834.0  215.0   777.0            100.0     None

  other_chicken turkey
0          None   None
1          None   None
2          None   None
3          None   None
4          None   None
5          None   None
6          None   None
7          None   None
8          None   None
9          None   None

In [37]:
# ORDER BY; Order the rows by the specified column.

print(pysqldf("SELECT * \
                  FROM meat \
                  WHERE pork > 100 \
                  ORDER BY pork \
                  LIMIT 30;"))

                          date    beef   veal   pork  lamb_and_mutton  \
0   1946-09-01 00:00:00.000000   366.0   98.0  124.0             63.0
1   1948-08-01 00:00:00.000000   705.0  121.0  463.0             59.0
2   1946-06-01 00:00:00.000000   461.0   78.0  505.0             75.0
3   1948-09-01 00:00:00.000000   773.0  127.0  514.0             68.0
4   1945-08-01 00:00:00.000000   858.0  145.0  531.0             77.0
5   1947-08-01 00:00:00.000000   766.0  131.0  534.0             57.0
6   1945-09-01 00:00:00.000000   910.0  164.0  535.0             80.0
7   1947-09-01 00:00:00.000000   888.0  154.0  549.0             66.0
8   1948-07-01 00:00:00.000000   681.0  116.0  576.0             55.0
9   1953-08-01 00:00:00.000000  1007.0  142.0  582.0             55.0
10  1949-07-01 00:00:00.000000   743.0  103.0  584.0             45.0
11  1955-07-01 00:00:00.000000  1045.0  123.0  594.0             53.0
12  1954-07-01 00:00:00.000000  1078.0  143.0  596.0             59.0
13  1953-07-01 00:00:00.000000  1034.0  138.0  597.0             54.0
14  1946-08-01 00:00:00.000000   871.0  138.0  601.0             72.0
15  1949-08-01 00:00:00.000000   835.0  123.0  605.0             54.0
16  1947-03-01 00:00:00.000000   829.0  104.0  606.0             62.0
17  1945-07-01 00:00:00.000000   736.0  117.0  610.0             82.0
18  1954-05-01 00:00:00.000000  1007.0  115.0  616.0             54.0
19  1950-07-01 00:00:00.000000   754.0   97.0  617.0             46.0
20  1953-05-01 00:00:00.000000   961.0  107.0  619.0             52.0
21  1945-10-01 00:00:00.000000  1022.0  201.0  628.0             95.0
22  1948-04-01 00:00:00.000000   700.0  101.0  629.0             53.0
23  1949-05-01 00:00:00.000000   747.0   92.0  630.0             38.0
24  1950-08-01 00:00:00.000000   829.0  108.0  633.0             52.0
25  1949-09-01 00:00:00.000000   821.0  121.0  637.0             55.0
26  1952-08-01 00:00:00.000000   793.0  100.0  637.0             49.0
27  1954-08-01 00:00:00.000000  1080.0  149.0  641.0             60.0
28  1953-06-01 00:00:00.000000   999.0  128.0  644.0             50.0
29  1949-04-01 00:00:00.000000   721.0   91.0  647.0             34.0

   broilers other_chicken turkey
0      None          None   None
1      None          None   None
2      None          None   None
3      None          None   None
4      None          None   None
5      None          None   None
6      None          None   None
7      None          None   None
8      None          None   None
9      None          None   None
10     None          None   None
11     None          None   None
12     None          None   None
13     None          None   None
14     None          None   None
15     None          None   None
16     None          None   None
17     None          None   None
18     None          None   None
19     None          None   None
20     None          None   None
21     None          None   None
22     None          None   None
23     None          None   None
24     None          None   None
25     None          None   None
26     None          None   None
27     None          None   None
28     None          None   None
29     None          None   None

In [38]:
# ORDER BY; Order the rows by the specified column. This time in descending order.

print(pysqldf("SELECT * \
                  FROM meat \
                  WHERE pork > 100 \
                  ORDER BY pork DESC\
                  LIMIT 30;"))

                          date    beef  veal    pork  lamb_and_mutton  \
0   2012-10-01 00:00:00.000000  2343.7  10.3  2210.4             14.2
1   2008-10-01 00:00:00.000000  2340.9  13.5  2159.9             15.0
2   2008-01-01 00:00:00.000000  2232.7  11.3  2159.0             14.7
3   2007-10-01 00:00:00.000000  2443.0  11.1  2145.1             16.4
4   2009-10-01 00:00:00.000000  2275.7  12.2  2089.0             14.3
5   2011-11-01 00:00:00.000000  2148.8  10.8  2086.7             12.6
6   2012-11-01 00:00:00.000000  2206.6  10.1  2078.7             12.4
7   2010-11-01 00:00:00.000000  2235.5  11.3  2068.0             14.4
8   2011-12-01 00:00:00.000000  2126.3  10.8  2065.6             12.5
9   2010-12-01 00:00:00.000000  2270.9  11.7  2055.4             14.9
10  2011-03-01 00:00:00.000000  2266.2  12.1  2054.4             14.1
11  2008-12-01 00:00:00.000000  2082.0  13.3  2052.1             15.4
12  2007-11-01 00:00:00.000000  2228.8  10.1  2045.2             16.1
13  2010-03-01 00:00:00.000000  2211.2  12.2  2040.1             17.7
14  2011-10-01 00:00:00.000000  2215.1  10.6  2033.2             11.7
15  2009-01-01 00:00:00.000000  2117.9  12.0  2027.0             13.3
16  2008-04-01 00:00:00.000000  2255.4  11.9  2015.6             15.3
17  2010-10-01 00:00:00.000000  2234.9  11.4  2002.7             13.1
18  2009-09-01 00:00:00.000000  2234.1  11.7  2002.1             14.8
19  2012-08-01 00:00:00.000000  2367.5  10.1  1997.9             14.2
20  2012-03-01 00:00:00.000000  2159.8  10.0  1987.9             14.2
21  2012-01-01 00:00:00.000000  2113.8  10.4  1987.0             12.1
22  2009-12-01 00:00:00.000000  2134.4  13.1  1985.3             15.9
23  2008-09-01 00:00:00.000000  2269.9  12.8  1975.8             14.5
24  2007-12-01 00:00:00.000000  2061.4  10.4  1972.7             15.4
25  2009-03-01 00:00:00.000000  2144.0  12.2  1969.7             15.9
26  2008-03-01 00:00:00.000000  2100.5  11.3  1962.0             16.0
27  2011-09-01 00:00:00.000000  2215.2  10.7  1954.4             11.8
28  2006-10-01 00:00:00.000000  2236.4  13.2  1932.0             15.7
29  2012-05-01 00:00:00.000000  2232.0  10.4  1926.8             13.6

    broilers  other_chicken  turkey
0     3335.0           43.8   579.9
1     3270.6           50.6   581.8
2     3237.2           45.7   546.4
3     3383.8           47.6   585.1
4     3071.9           44.6   508.3
5     2907.1           39.8   511.4
6     3006.7           37.5   515.3
7     3124.4           40.3   520.5
8     2855.8           41.4   458.9
9     3175.0           44.1   461.4
10    3310.4           44.1   503.1
11    2931.5           39.8   492.1
12    3033.2           41.0   526.0
13    3162.0           43.4   490.0
14    3096.8           43.4   524.5
15    2871.6           38.3   469.2
16    3196.6           48.0   519.2
17    3183.7           41.0   524.3
18    3064.3           43.1   467.9
19    3317.4           51.0   530.1
20    3043.7           40.1   502.1
21    3091.8           43.2   476.7
22    2966.2           38.4   456.3
23    3149.7           49.0   515.4
24    2901.4           38.1   460.8
25    2997.0           42.5   471.4
26    2981.6           45.1   487.0
27    3180.4           47.0   473.2
28    3185.1           44.0   540.9
29    3278.0           47.7   519.9

In [ ]:
# GROUP BY; G

print(pysqldf("SELECT * \
                  FROM meat \
                  WHERE lamb_and_mutton IS NOT NULL OR pork > 100 \
                  GROUP BY beef \
                  LIMIT 30;"))

In [42]:

print(pysqldf("SELECT *, \
                  CASE WHEN pork > 1000 THEN 'expensive' \
                  ELSE 'cheap' END AS price_category \
                  FROM meat \
                  WHERE lamb_and_mutton IS NOT NULL OR pork > 100\
                  ORDER BY beef;"))

                           date    beef  veal    pork  lamb_and_mutton  \
0    1946-09-01 00:00:00.000000   366.0  98.0   124.0             63.0
1    1946-06-01 00:00:00.000000   461.0  78.0   505.0             75.0
2    1951-06-01 00:00:00.000000   591.0  78.0   798.0             39.0
3    1946-05-01 00:00:00.000000   605.0  83.0   810.0             65.0
4    1944-04-01 00:00:00.000000   650.0  89.0   978.0             66.0
..                          ...     ...   ...     ...              ...
822  2006-06-01 00:00:00.000000  2446.1  12.4  1663.3             14.4
823  2006-08-01 00:00:00.000000  2450.0  12.8  1780.2             14.6
824  2007-08-01 00:00:00.000000  2450.6  10.3  1850.0             14.8
825  2002-08-01 00:00:00.000000  2469.0  16.7  1637.0             16.6
826  2002-10-01 00:00:00.000000  2512.0  18.7  1831.0             19.7

     broilers  other_chicken  turkey price_category
0         NaN            NaN     NaN          cheap
1         NaN            NaN     NaN          cheap
2         NaN            NaN     NaN          cheap
3         NaN            NaN     NaN      expensive
4         NaN            NaN     NaN      expensive
..        ...            ...     ...            ...
822    3046.9           46.3   509.0      expensive
823    3133.9           46.3   501.0      expensive
824    3181.2           47.4   522.2      expensive
825    2828.3           49.2   481.9      expensive
826    2953.3           50.7   525.9      expensive

[827 rows x 9 columns]

In [ ]:
print(pysqldf("SELECT *, \
                  CASE WHEN beef > 600 AND pork > 1800 THEN 'expensive' \
                  ELSE 'cheap' END AS price_category \
                  FROM meat \
                  WHERE lamb_and_mutton IS NOT NULL OR pork > 100;"))

In [ ]:
print(pysqldf("SELECT *, \
                  CASE WHEN beef > 600 OR pork > 800 THEN 'expensive' \
                  ELSE 'cheap' END AS price_category \
                  FROM meat \
                  GROUP BY price_category, date"))